// Прочитайте главу 4 книги Роберта Мартина «Чистый код».
// Выпишите ниже рекомендации по употреблению комментариев в коде.
// Рекомендации:
// Прочитайте главу 4 книги Роберта Мартина «Чистый код».
// Выпишите ниже рекомендации по употреблению комментариев в коде.
// Рекомендации:
/* 1.Комментарии не компенсируют плохого кода, лучше исправить код чем добавить кучу ненужных комментариев
2. С помощью комментариев объясните свои намерения, что вы собираетесь сделать частью кода.
3.Помимо намерений, хорошим комментарием считается пояснения к коду или же предупреждения, а также Комментарии TODO
4.Не стоит лепить комментарии «на скорую руку» только потому, что вам кажется, что это уместно или этого требует процесс
5. Не нужно добавлять избыточные комментарии.
6.Не стоит делать неточные заявления в комментариях
7.Журнальные и обязательные комментарии  нагромождают код
8."Шум" или же бесполезные комментарии, а также позиционные маркеры также вредят чистоте кода.
9.Не используйте комментарии там, где можно
использовать функцию или переменную
10. Комментарии за закрывающей фигурной скобкой и ссылки на авторов загромождают компактные специализированные функции, которым мы отдает
предпочтение.
11. Лучше удалить ненужный код, чем комментировать его.
12.Не включайте в комментарии интересные исторические дискуссии или описания подробностей, не относящиеся к делу
13.Если вы должны написать комментарий, проследите за тем, чтобы он описывал
находящийся поблизости код. Не излагайте информацию системного уровня
в контексте локального комментария
14.HTML в комментариях к исходному
коду выглядит отвратительно. Он затрудняет чтение комментариев именно там,
где они должны легко читаться — в редакторе/IDE.
*/ 

#include <iostream>

int main() {
    std::cout << "There is no useful output. Read comments" << std::endl;
}
