// Прочитайте главу 4 книги Роберта Мартина «Чистый код».
// Выпишите ниже рекомендации по употреблению комментариев в коде.
//
// Рекомендации:
// - не использовать комментарии там, где можно обойтись без них.
// - комментарии должны быть точными.
// - комментарии должны быть достоверными.
// - комментарий нужен для того, чтобы понять то, что неочевидно при чтении кода.
// - комментарии должны быть понятными не только для автора кода.
#include <iostream>

int main() {
    std::cout << "There is no useful output. Read comments" << std::endl;
}
